{
  "projects": [
    {
      "id": 1,
      "title": "Portfolio Web",
      "description": "Este é o meu portfolio profissional, construído com Next.js 16, React 19 e TypeScript, mas com um toque que representa muito da minha personalidade: um design totalmente inspirado na Steam.",
      "image": ["../assets/projects/portfolio/portfolio-img-01.png", "../assets/projects/portfolio/portfolio-img-02.png", "../assets/projects/portfolio/portfolio-img-03.png", "../assets/projects/portfolio/portfolio-img-04.png", "../assets/projects/portfolio/portfolio-img-05.png", "../assets/projects/portfolio/portfolio-img-06.png", "../assets/projects/portfolio/portfolio-img-07.png", "../assets/projects/portfolio/portfolio-img-08.png"],
      "className": "projectCard--portfolio",
      "detailsLink": "https://github.com/nevesfg/portfolio",
      "viewLink": "https://nevesfg.com",
      "technologies": ["Next.js", "React", "TypeScript", "Tailwind CSS", "HTML5", "CSS3"],
      "isPublic": true,
      "date": "16/11/2025",
      "aboutProject": "Meu Portfolio — Inspirado no universo dos games, pensado para devs \n\nEste é o meu portfolio profissional, construído com Next.js 16, React 19 e TypeScript, mas com um toque que representa muito da minha personalidade: um design totalmente inspirado na Steam. \nQuem ama jogos vai reconhecer na hora. \n\nA proposta foi criar uma experiência moderna, fluida e imersiva — não apenas um site de portfolio, mas um ambiente interativo onde cada detalhe conversa com o usuário. \nNavegação lateral retrátil, interface escura com atmosfera de aventura, animações suaves, efeitos de blur, transições bem trabalhadas e um layout que homenageia a estética gamer que sempre fez parte da minha vida. \n\nAlém do visual, o portfolio conta com funcionalidades robustas: \n\n• Sistema dinâmico de projetos com filtros por stack e barra de busca \n\n• Integração com GitHub API para estatísticas reais \n\n• Sistema de comentários moderado por IA (OpenAI) \n\n• Autenticação via LinkedIn OAuth \n\n• Renderização otimizada com Server Components do Next.js \n\n• Design totalmente responsivo (mobile, tablet e desktop) \n\nEste projeto representa minha visão como desenvolvedor: unir tecnologia, criatividade e experiência do usuário — tudo com a estética descontraída que sempre me acompanhou no mundo dos games."
    },
    {
      "id": 2,
      "title": "Kyv3D Calculator",
      "description": "Uma ferramenta profissional e gratuita para precificação de impressão 3D, considerando todos os custos reais do processo.",
      "image": ["../assets/projects/kyv3d/kyv3d-calculator-01.png", "../assets/projects/kyv3d/kyv3d-calculator-02.png", "../assets/projects/kyv3d/kyv3d-calculator-03.png", "../assets/projects/kyv3d/kyv3d-calculator-04.png", "../assets/projects/kyv3d/kyv3d-calculator-05.png", "../assets/projects/kyv3d/kyv3d-calculator-06.png"],
      "className": "projectCard--calculator",
      "detailsLink": "https://3dprint.kyvme.com/",
      "viewLink": "https://3dprint.kyvme.com/",
      "technologies": ["Next.js", "TypeScript", "Tailwind CSS", "HTML5", "CSS3"],
      "isPublic": false,
      "date": "05/11/2025",
      "aboutProject": "A Kyv3D Calculator é uma ferramenta desenvolvida para trazer precisão, clareza e profissionalismo ao processo de precificação em impressão 3D. Depois de anos acompanhando a comunidade e enfrentando os mesmos desafios — cálculos manuais, preços inconsistentes e custos ocultos — decidi criar uma solução completa que realmente resolvesse o problema. \n\nA plataforma considera todos os fatores que influenciam o preço final de uma peça: consumo real de material, energia, desgaste do equipamento, manutenção, tempo trabalhado, pós-processamento, custos administrativos e taxas de marketplace. Além disso, permite simular cenários com impostos e descontos, garantindo uma visão ampla e estratégica para quem vende no varejo ou atacado. \n\nConstruída com Next.js, TypeScript e uma arquitetura pensada para desempenho e confiabilidade, a Kyv3D Calculator funciona perfeitamente em qualquer dispositivo — do celular ao desktop — e foi projetada para ser simples, direta e poderosa. \n\nA ferramenta também permite cadastrar filamentos, produtos, impressoras e marketplaces, além de exportar e importar todas as configurações em um arquivo .json. Isso torna a experiência ainda mais prática para quem trabalha no dia a dia com múltiplos projetos ou setups diferentes. \n\nAcredito que conhecimento deve ser acessível, por isso a ferramenta é totalmente gratuita. Meu objetivo é ajudar a comunidade a precificar com mais confiança, profissionalismo e sustentabilidade — seja você um maker que imprime por hobby ou um vendedor que vive do seu trabalho."
    },
    {
      "id": 3,
      "title": "Trust me?",
      "description": "?",
      "image": ["../assets/projects/hihi/trust-me.png","../assets/projects/hihi/trust-me.png"],
      "className": "projectCard--ecommerce",
      "detailsLink": "https://nevesfg.com/hihi/",
      "viewLink": "https://nevesfg.com/hihi/dragon/",
      "technologies": ["Vue.js", "HTML5", "CSS3"],
      "isPublic": false,
      "date": "25/03/2025",
      "aboutProject": "?"
    },
    {
      "id": 4,
      "title": "DQUALITTY Static Page",
      "description": "Uma página moderna e responsiva, desenvolvida para apresentar produtos, informações e identidade visual minimalista da DQUALITTY com muita clareza.",
      "image": ["../assets/projects/dqualitty/dqualitty-img-01.png", "../assets/projects/dqualitty/dqualitty-img-02.png","../assets/projects/dqualitty/dqualitty-img-03.png", "../assets/projects/dqualitty/dqualitty-img-04.png","../assets/projects/dqualitty/dqualitty-img-05.png", "../assets/projects/dqualitty/dqualitty-img-06.png","../assets/projects/dqualitty/dqualitty-img-07.png", "../assets/projects/dqualitty/dqualitty-img-08.png","../assets/projects/dqualitty/dqualitty-img-09.png", "../assets/projects/dqualitty/dqualitty-img-10.png"],
      "className": "projectCard--dqualitty",
      "detailsLink": "https://dqualitty.com.br/",
      "viewLink": "https://dqualitty.com.br/",
      "technologies": ["JavaScript", "HTML5", "CSS3"],
      "isPublic": false,
      "date": "03/01/2025",
      "aboutProject": "A página institucional da DQUALITTY foi desenvolvida com o objetivo de apresentar a empresa, seus produtos e seus canais de contato de forma clara, moderna e acessível. Construída utilizando HTML, CSS e JavaScript puro, a aplicação foi pensada para ser leve, responsiva e intuitiva, garantindo uma navegação agradável tanto em dispositivos móveis quanto no desktop. \n\nO projeto inclui páginas dedicadas para produtos, informações institucionais, localização e contato, com foco total na experiência do usuário. Cada componente da interface foi cuidadosamente estruturado para destacar o catálogo de móveis escolares e corporativos da empresa, mantendo a identidade visual profissional e coerente com a marca. \n\nAlém disso, o site conta com um formulário funcional para envio de mensagens, integração com WhatsApp e exibição de mapas via Google Maps, facilitando o acesso do cliente às informações essenciais. \nA organização do conteúdo privilegia simplicidade e eficiência, apresentando as categorias de produtos de maneira estruturada, com seções que valorizam cada item e facilitam a tomada de decisão do usuário. \n\nO resultado é uma página estática rápida, objetiva e visualmente agradável, capaz de reforçar a presença digital da DQUALITTY e transmitir credibilidade ao público. \n\nUma solução direta, funcional e alinhada às necessidades reais da empresa."
    },
    {
      "id": 5,
      "title": "Booyah Leaderboard",
      "description": "Um sistema moderno e completo para gerenciamento de campeonatos de Free Fire, automatizando tabelas, cálculos e resultados de forma rápida e inteligente.",
      "image": ["../assets/projects/booyah-leaderboard/booyah-img-01.png", "../assets/projects/booyah-leaderboard/booyah-img-02.png", "../assets/projects/booyah-leaderboard/booyah-img-03.png", "../assets/projects/booyah-leaderboard/booyah-img-04.png"],
      "className": "projectCard--booyah",
      "detailsLink": "https://liaocup.nevesfg.com/",
      "viewLink": "https://liaocup.nevesfg.com/",
      "technologies": ["Next.js", "Discord.js", "MongoDB", "HTML5", "CSS3"],
      "isPublic": false,
      "date": "11/12/2024",
      "aboutProject": "Este projeto marca a evolução de uma ferramenta que criei há quatro anos para auxiliar organizadores de campeonatos de Free Fire — originalmente um bot de Discord utilizado no campeonato LiãoCup, do Cerol. O objetivo inicial era simples: facilitar a criação de tabelas de pontuação e kills pelo próprio Discord, otimizando o fluxo de quem organizava partidas diretamente pelo celular. \n\nCom o tempo, o antigo bot mostrou limitações — especialmente por salvar dados apenas em cache, o que resultava em perda de informações a cada reinício. Para resolver isso e dar um passo adiante, transformei a ferramenta em um sistema web completo, estável e escalável, oferecendo muito mais controle, automação e segurança. \n\nHoje, o sistema permite: \n\n- Inserir dados de forma rápida e intuitiva através de formulários organizados; \n\n- Alternar entre diferentes tabelas de salas e campeonatos com apenas um clique; \n\n- Manter todos os registros salvos de forma persistente, graças à integração com MongoDB; \n\nTrabalhar com dois modos de tabela: \n\n• 15 times — pontuação fornecida pela sala, exibida automaticamente em ordem decrescente; \n\n• 12 times — cálculos automáticos baseados em configurações ajustáveis (pontuação por kill, colocação, total de pontos etc.); \n\n- Gerar, limpar, baixar e até enviar tabelas diretamente no Discord. \n\nAlém da funcionalidade, dediquei atenção à identidade visual e à experiência do usuário. Todo o design foi criado manualmente, utilizando HTML e CSS puro, sem frameworks de estilização. No mobile, implementei um sistema de modais pensado para deixar a experiência mais leve, clara e prática. A responsividade foi trabalhada linha por linha, garantindo uma interface imersiva, com ambiente visual temático e estética moderna. \n\nO sistema foi desenvolvido utilizando: \n\n- Next.js no front-end; \n\n- MongoDB para armazenamento seguro e persistente; \n\n- HTML e CSS puro para estilização personalizada e responsiva; \n\n- Integração com Discord para envio automático de tabelas. \n\nO projeto é privado, mas representa uma evolução significativa no gerenciamento de campeonatos e na aplicação de tecnologia em eSports. Foi também o meu primeiro projeto concluído do ano — e um marco importante na minha trajetória como desenvolvedor. \n\nSe você trabalha com campeonatos, eSports ou ferramentas para jogos competitivos, fico feliz em conversar sobre como esse tipo de tecnologia pode impulsionar processos e automatizar rotinas."
    },
    {
      "id": 6,
      "title": "OSGenealogy",
      "description": "Pagina estática da Árvore Genealógica de Sistemas Operacionais - Projeto destinado a máteria de Sistemas Distribuidos",
      "image": ["../assets/projects/OSGenealogy/osgenealogy-img-01.png", "../assets/projects/OSGenealogy/osgenealogy-img-02.png"],
      "className": "projectCard--osgenealogy",
      "detailsLink": "https://github.com/nevesfg/OSGenealogy",
      "viewLink": "https://nevesfg.com/osgenealogy/",
      "technologies": ["Vue.js", "HTML5", "CSS3"],
      "isPublic": true,
      "date": "05/06/2024",
      "aboutProject": "O projeto (Árvore Genealógica de Sistemas Operacionais) é uma visualização interativa que mapeia a evolução e as conexões entre diversos sistemas operacionais ao longo do tempo. Utilizando uma interface gráfica baseada em uma árvore genealógica, o site permite aos usuários explorar a linhagem de sistemas operacionais desde os primórdios do UNIX até os mais modernos, como Android e macOS. Este projeto é ideal para estudantes, entusiastas de tecnologia e profissionais que desejam entender melhor a história e as relações entre os sistemas operacionais."
    },
    {
      "id": 7,
      "title": "Desafio de Estágio",
      "description": "Sistema web completo para autenticação e gerenciamento de usuários, desenvolvido com Vue.js e Django REST Framework durante um desafio técnico.",
      "image": ["../assets/projects/desafio-lsmais/desafio-lsmais-img-01.png", "../assets/projects/desafio-lsmais/desafio-lsmais-img-02.png", "../assets/projects/desafio-lsmais/desafio-lsmais-img-03.png", "../assets/projects/desafio-lsmais/desafio-lsmais-img-04.png"],
      "className": "projectCard--lsmais",
      "detailsLink": "https://github.com/nevesfg/stage-grid-auth",
      "viewLink": "https://nevesfg.com/desafio-lsmais/",
      "technologies": ["Vue.js", "Python3","Django" , "HTML5", "CSS3"],
      "isPublic": true,
      "date": "15/03/2024",
      "aboutProject": "Este projeto marcou um momento muito importante para mim: foi o desafio técnico que precisei desenvolver durante um processo seletivo — e que, felizmente, me garantiu a aprovação. 😊 \nEle representa uma etapa fundamental na minha evolução com Vue.js, pois reuniu tudo o que venho estudando sobre o framework em um cenário prático e real. \n\nO desafio consistia em criar um sistema completo com tela de login, validação de credenciais, autenticação, cadastro de usuários e exibição desses usuários em grid, tudo isso consumindo uma API feita com Django REST Framework + MySQL. \nFoi exatamente o tipo de projeto que exige organização, lógica e domínio de fluxo entre front-end e back-end — e isso tornou a experiência ainda mais enriquecedora. \n\nDurante o desenvolvimento, pude aplicar conceitos essenciais, como: \n\n• Solicitações assíncronas ao backend \n\n• Autenticação, tokens, fluxo de login e persistência da sessão \n\n• Integração total com API REST \n\n• Consulta dinâmica aos usuários cadastrados \n\n• Validação de dados no front-end \n\n• Interface 100% estilizada manualmente (HTML + CSS), incluindo responsividade sem frameworks \n\nO que mais gostei neste projeto foi justamente o equilíbrio entre a parte visual — onde pude criar telas customizadas sem base de design pronta — e a parte lógica, conectando Vue.js com uma API robusta construída em Django REST Framework. \n\nFoi um aprendizado muito valioso, que reforçou minha adaptação ao Vue.js, minha prática com integração fullstack e, principalmente, minha evolução como desenvolvedor. E sim… foi daqui que saiu a aprovação para o estágio. 🚀 \n\nSe você curte Vue.js, APIs REST ou simplesmente gosta de ver projetos reais construídos do zero, vale a pena dar uma olhada! 🙂"
    },
    {
      "id": 8,
      "title": "BookFlow",
      "description": "Um aplicativo mobile e webservice criado para facilitar a troca, empréstimo e localização de livros entre pessoas da mesma região, integrando mapa, QR Code e comunicação direta.",
      "image": ["../assets/projects/bookflow/bookflow-img.jpeg", "../assets/projects/bookflow/bookflow-img.jpeg"],
      "className": "projectCard--bookflow",
      "detailsLink": "https://github.com/nevesfg",
      "viewLink": "https://www.linkedin.com/posts/nevesfg_ol%C3%A1-galera-boa-tarde-estou-entusiasmado-activity-7175577230977220608-Tmav?utm_source=share&utm_medium=member_desktop&rcm=ACoAAD3Nb_gBy-kXdXxtlJQ2SxhoHl-B_9P45Lc",
      "technologies": ["Django", "React", "HTML5", "CSS3"],
      "isPublic": false,
      "date": "08/01/2024",
      "aboutProject": "O BookFlow é um aplicativo mobile e webservice desenvolvido para conectar pessoas através da leitura, permitindo a troca e o empréstimo de livros de forma prática e colaborativa. O projeto foi construído combinando Django Rest Framework (DRF) no back-end e React Native no front-end, criando uma plataforma moderna, intuitiva e funcional. \n\nCriado em equipe, o aplicativo nasceu com a proposta de aproximar leitores, facilitar o compartilhamento de livros e tornar a experiência de empréstimo muito mais simples. A integração entre as ferramentas e o design foi pensada para garantir uma navegação fluida e um fluxo de uso direto e eficiente. \n\nEntre suas funcionalidades, o BookFlow permite localizar livros próximos utilizando o mapa integrado, registrar livros via QR Code, e conversar diretamente com outros usuários através do chat interno, tornando todo o processo rápido e seguro. \n\nEsse projeto foi desenvolvido em colaboração com Victor Neves, Larissa Souza, Adauto Benevides e Italo Jeferson, unindo competências e diferentes áreas do desenvolvimento para entregar uma solução completa que incentiva a leitura, o compartilhamento e a sustentabilidade."
    },
    {
      "id": 9,
      "title": "Cardapio/Delivery",
      "description": "Um sistema de cardápio online com pedidos presenciais e delivery, desenvolvido em equipe com mob programming para oferecer uma experiência rápida, intuitiva e totalmente integrada para restaurantes.",
      "image": ["../assets/projects/pratocerto/cardapio-img-01.jpeg", "../assets/projects/pratocerto/cardapio-img-02.jpeg","../assets/projects/pratocerto/cardapio-img-03.jpeg","../assets/projects/pratocerto/cardapio-img-04.jpeg"],
      "className": "projectCard--cardapio",
      "detailsLink": "https://github.com/nevesfg",
      "viewLink": "https://www.linkedin.com/posts/nevesfg_oi-boa-tarde-venho-aqui-compartilhar-um-activity-7086044490255220736-XcWj?utm_source=share&utm_medium=member_desktop&rcm=ACoAAD3Nb_gBy-kXdXxtlJQ2SxhoHl-B_9P45Lc",
      "technologies": ["Python3","Django", "Bootstrap", "HTML5", "CSS3"],
      "isPublic": false,
      "date": "18/06/2023",
      "aboutProject": "Baycar - Plataforma de Venda e Aluguel de Carros \n\nProjeto desenvolvido utilizando a linguagem JAVA, destinado a matéria Linguagem de Programação Orientada a Objetos \n\nO Baycar é um software criado para realizar e gerenciar a venda de carros novos, usados e a locação de carros, a fim de criar um sistema organizado e eficiente para que os funcionários saibam onde estão e quais são as informações para o devido objetivo de negócio, permitindo a empresa verificar a situação das vendas, locações e consultar as negociações com os clientes."
    },
    {
      "id": 10,
      "title": "Baycar",
      "description": "Baycar - Plataforma de Venda e Aluguel de Carros | Projeto desenvolvido utilizando a linguagem JAVA, destinado a matéria Linguagem de Programação Orientada a Objetos",
      "image": ["../assets/projects/baycar/baycar-img-01.png", "../assets/projects/baycar/baycar-img-02.png","../assets/projects/baycar/baycar-img-03.png","../assets/projects/baycar/baycar-img-04.png","../assets/projects/baycar/baycar-img-05.png","../assets/projects/baycar/baycar-img-06.png"],
      "className": "projectCard--baycar",
      "detailsLink": "https://github.com/nevesfg/baycar",
      "viewLink": "https://nevesfg.com/baycar/",
      "technologies": ["Java", "Bootstrap", "HTML5", "CSS3"],
      "isPublic": true,
      "date": "09/02/2023",
      "aboutProject": "Baycar - Plataforma de Venda e Aluguel de Carros \n\nProjeto desenvolvido utilizando a linguagem JAVA, destinado a matéria Linguagem de Programação Orientada a Objetos \n\nO Baycar é um software criado para realizar e gerenciar a venda de carros novos, usados e a locação de carros, a fim de criar um sistema organizado e eficiente para que os funcionários saibam onde estão e quais são as informações para o devido objetivo de negócio, permitindo a empresa verificar a situação das vendas, locações e consultar as negociações com os clientes."
    },
    {
      "id": 11,
      "title": "SysIF",
      "description": "Projeto proposto pelo professor Woquiton Fernandes, idealizado e desenvolvido pela turma 3ADS 2022.1, na materia de Linguagem de Programação Orientada a Objetos. Sistema desenvolvido em Python e Django.",
      "image": ["../assets/projects/sysif/sysif-prototipagem-img-01.png", "../assets/projects/sysif/sysif-prototipagem-img-02.png","../assets/projects/sysif/sysif-img-01.png", "../assets/projects/sysif/sysif-img-02.png", "../assets/projects/sysif/sysif-img-03.png", "../assets/projects/sysif/sysif-img-04.png", "../assets/projects/sysif/sysif-img-05.png", "../assets/projects/sysif/sysif-img-06.png", "../assets/projects/sysif/sysif-img-07.png", "../assets/projects/sysif/sysif-img-08.png", "../assets/projects/sysif/sysif-img-09.png"],
      "className": "projectCard--sysif",
      "detailsLink": "https://github.com/nevesfg/sys-if",
      "viewLink": "https://nevesfg.com/sysif/",
      "technologies": ["Python3", "Django", "HTML5", "CSS3"],
      "isPublic": true,
      "date": "23/12/2022",
      "aboutProject": "Este projeto representa uma das experiências mais marcantes que tive durante minha formação. O SysIF (Sistema Integrado de Gestão Acadêmica) foi proposto pelo professor Woquiton Fernandes e desenvolvido pela turma 3ADS 2022.1 como parte da disciplina de Programação Orientada a Objetos. A ideia era criar uma aplicação web capaz de automatizar os processos administrativos de uma instituição de ensino — algo que, na prática, substitui planilhas, documentos e fluxos manuais por um sistema robusto, seguro e centralizado. \n\nAntes de iniciar o desenvolvimento, produzi duas telas conceituais — as primeiras duas imagens apresentadas no projeto — que foram prototipadas, estilizadas e montadas completamente por mim. A proposta era definir desde o início uma direção visual moderna, organizada e agradável. As demais imagens representam o sistema em execução, funcionando com a interface que implementei em conjunto com toda a lógica de regras acadêmicas. \n\nO sistema foi construído em Python e Django, aplicando conceitos essenciais de POO como herança, encapsulamento e modularidade. A aplicação conta com seis módulos principais (Aluno, Professor, Curso, Disciplina, Turma e Avaliação), todos integrados entre si. Durante o desenvolvimento, implementei regras inteligentes de negócio que tornam o sistema muito mais do que um CRUD tradicional, como: \n\n• geração automática de matrícula no padrão institucional SYS22M02N0X; \n\n• prevenção de duplicidade de turmas; \n\n• controle rigoroso no lançamento de notas, permitindo registrar avaliações apenas para alunos devidamente matriculados; \n\n• exclusão automática de avaliações caso o aluno deixe a turma; \n\n• organização integrada entre alunos, disciplinas, professores e turmas. \n\nA aplicação foi totalmente containerizada com Docker, o que garante portabilidade, isolamento e execução simplificada em qualquer ambiente. Além da estrutura técnica, também me dediquei à experiência visual, criando uma interface limpa e intuitiva, incluindo o painel administrativo, telas de cadastro, navegação lateral e toda a estilização baseada nos protótipos originais que desenvolvi. \n\nO SysIF é um projeto especial porque reúne, em um único sistema, vários pilares fundamentais da minha formação: lógica de programação, orientação a objetos, desenvolvimento web, boas práticas visuais e arquitetura de software. Foi uma experiência extremamente enriquecedora e que consolidou parte importante da minha trajetória como desenvolvedor."
    },
    {
      "id": 12,
      "title": "Cardlink V2",
      "description": "Card de links pessoal, atualizado com design mais moderno, responsivo e minimalista, reunindo meus principais perfis e informações essenciais.",
      "image": ["../assets/projects/cardlink-v2/card-img.png", "../assets/projects/cardlink-v2/card-img.png"],
      "className": "projectCard--cardv2",
      "detailsLink": "https://nevesfg.com/cardlinks/v2/",
      "viewLink": "https://nevesfg.com/cardlinks/v2/",
      "technologies": ["HTML5", "CSS3"],
      "isPublic": false,
      "date": "24/11/2022",
      "aboutProject": "Este projeto é a versão atualizada do meu Card de Links e Apresentação, uma página pessoal criada para reunir de forma prática e estilosa meus principais perfis e canais de contato. Ele nasceu da evolução direta do meu primeiro card, trazendo agora um visual mais limpo, responsivo e com foco em simplicidade, sem perder personalidade. \n\nA base do design foi inspirada no meu próprio estilo visual da época, combinando elementos do meu antigo projeto estático e referências do Discord — o que me permitiu criar algo que fosse ao mesmo tempo pessoal e reconhecível. Embora tenha sido construído com HTML e CSS, foi um ótimo exercício de organização, identidade visual e semântica. \n\nO projeto foi desenvolvido em 24/11/2022, durante uma fase em que eu buscava melhorar a forma como me apresentava online. Ele representa um ponto importante da minha jornada, marcando o momento em que comecei a refinar meu estilo, repaginar meus layouts e entender melhor como entregar uma interface agradável, objetiva e funcional. \n\nMesmo simples, este card mostra parte da minha evolução como desenvolvedor e como criador de identidade digital — e continua sendo uma peça especial dentro da minha trajetória."
    },
    {
      "id": 13,
      "title": "Projeto IHM",
      "description": "Desenvolvido para a disciplina de Interface Homem Máquina e consiste em uma Pokédex interativa com páginas dedicadas a diferentes Pokémon. O projeto demonstra o uso de conceitos basicos de desenvolvimento web, incluindo HTML5 e CSS3.",
      "image": ["../assets/projects/projetoihm/ihm-img-01.png", "../assets/projects/projetoihm/ihm-img-02.png", "../assets/projects/projetoihm/ihm-img-03.png", "../assets/projects/projetoihm/ihm-img-04.png", "../assets/projects/projetoihm/ihm-img-05.png", "../assets/projects/projetoihm/ihm-img-06.png", "../assets/projects/projetoihm/ihm-img-07.png", "../assets/projects/projetoihm/ihm-img-08.png", "../assets/projects/projetoihm/ihm-img-09.png", "../assets/projects/projetoihm/ihm-img-10.png", "../assets/projects/projetoihm/ihm-img-11.png", "../assets/projects/projetoihm/ihm-img-12.png", "../assets/projects/projetoihm/ihm-img-13.png", "../assets/projects/projetoihm/ihm-img-14.png", "../assets/projects/projetoihm/ihm-img-15.png"],
      "className": "projectCard--ihm",
      "detailsLink": "https://github.com/nevesfg/projetoihm",
      "viewLink": "https://nevesfg.com/ihm/",
      "technologies": ["HTML5", "CSS3"],
      "isPublic": true,
      "date": "05/06/2022",
      "aboutProject": "Uma aplicação web simples, rápida e totalmente construída com HTML e CSS puro. \n\nEste projeto foi desenvolvido como parte da disciplina de Interface Homem-Máquina (IHM) e representa um dos meus primeiros contatos com a criação de interfaces estáticas estruturadas do zero. Trata-se de uma Pokédex interativa, onde a página inicial funciona como um hub que direciona o usuário a diferentes páginas individuais — cada uma dedicada a um Pokémon específico e criada por um membro do grupo. \n\nMesmo sendo um projeto rápido e totalmente baseado em HTML5 + CSS3, ele demonstra a aplicação prática de conceitos fundamentais do desenvolvimento front-end, como: \n\n• Estruturação semântica com HTML5 \n\n• Estilização avançada com CSS3 \n\n• Uso de posicionamentos (relativo, absoluto e fixo) \n\n• Criação de seções independentes e bem organizadas \n\n• Primeiros passos em design responsivo \n\n• Construção visual sem frameworks ou bibliotecas externas \n\nCada página apresenta informações completas sobre o Pokémon escolhido — como efetividade de tipos, habilidades especiais, descrição da espécie, curiosidades e linha evolutiva — sempre com uma interface visual inspirada no universo Pokémon, buscando um design agradável e intuitivo. \n\nEste foi um trabalho importante na minha trajetória porque consolidou meus primeiros fundamentos em estrutura de layout, organização visual, hierarquia de conteúdo e experiência do usuário, tudo construído de forma manual, sem templates ou ferramentas prontas. \n\nEstrutura do Projeto \n\n• Página do Cubone – desenvolvida por mim (Clériston Victor Neves – @Nevesfg) \n\n• Página do Alakazam – desenvolvida por Ítalo Jeferson (@italo_sixx) \n\n• Página do Gengar – desenvolvida por Renan Magalhães (@renannz_)"
    },
    {
      "id": 14,
      "title": "Cardlink V1",
      "description": "Meu primeiro Card de Links, a versão original que marcou o início da minha identidade visual e das minhas páginas pessoais.",
      "image": ["../assets/projects/cardlink-v1/cardlink-img-01.png", "../assets/projects/cardlink-v1/cardlink-img-02.png"],
      "className": "projectCard--cardv1",
      "detailsLink": "https://github.com/nevesfg/first-portfolio-card",
      "viewLink": "https://nevesfg.com/cardlinks/v1/",
      "technologies": ["HTML5", "CSS3"],
      "isPublic": false,
      "date": "10/02/2022",
      "aboutProject": "Este projeto representa o início da minha jornada criando interfaces pessoais. Trata-se do meu primeiro Card de Links, uma versão simples e direta que reuniu meus principais perfis e uma breve descrição sobre mim na época em que foi desenvolvido. Mesmo sendo um projeto pequeno, ele marcou o momento em que comecei a organizar minha presença online e compreender melhor como apresentar minha identidade digital. \n\nCriado em 10/02/2022, o card foi construído utilizando apenas HTML e CSS, com base em uma página estática anterior — um layout que eu já havia desenvolvido para a seção de equipe do meu projeto KyuBot. A partir dessa estrutura, reorganizei os elementos, adicionei meus links pessoais e busquei inspiração estética no estilo dos perfis do Discord, o que ajudou a dar mais personalidade ao design. \n\nEssa primeira versão é especial porque registra a fase em que eu ainda estava descobrindo meu estilo visual, aprendendo a estruturar componentes, criando meus primeiros cartões interativos e experimentando formas de me apresentar profissionalmente. Apesar de simples, foi um passo essencial para os designs mais refinados e responsivos que desenvolvi depois. \n\nO resultado é um card básico, funcional e que reflete fielmente o começo da minha evolução como desenvolvedor — tanto tecnicamente quanto visualmente."
    },
    {
      "id": 15,
      "title": "KyuBot Page",
      "description": "Uma página responsiva criada como interface para o bot de Discord (Kyu), desenvolvida por mim e pelo meu amigo Giyu.",
      "image": ["../assets/projects/kyubot/kyubot-img-01.png", "../assets/projects/kyubot/kyubot-img-02.png", "../assets/projects/kyubot/kyubot-img-03.png", "../assets/projects/kyubot/kyubot-img-04.png", "../assets/projects/kyubot/kyubot-img-05.png"],
      "className": "projectCard--kyubot",
      "detailsLink": "https://github.com/nevesfg/kyubot-static-page",
      "viewLink": "https://nevesfg.com/kyubot/",
      "technologies": ["JavaScript", "HTML5", "CSS3"],
      "isPublic": true,
      "date": "16/06/2021",
      "aboutProject": "Este projeto é uma página estática totalmente responsiva desenvolvida em HTML, CSS e JavaScript, criada para servir como interface visual e informativa do bot de Discord chamado Kyu. Ele apresenta funcionalidades, informações e seções dedicadas ao bot, tudo construído com foco em organização, clareza e uma experiência agradável em diferentes tamanhos de tela. \n\nEmbora seja um projeto simples em sua estrutura, ele marcou um momento importante da minha evolução como desenvolvedor, especialmente no que diz respeito a design, responsividade e apresentação visual. \n\nEste foi o primeiro projeto no qual realmente tive a oportunidade de aplicar meu senso crítico de design e trabalhar de forma mais cuidadosa na apresentação da interface. \n\nPorém, ele não foi desenvolvido sozinho — foi criado por mim e pelo meu amigo Giyu, que me orientou em todo o processo, me ensinou conceitos importantes de responsividade manual apenas com CSS e me motivou a continuar aprendendo sobre construção de interfaces web mais profissionais. \n\nTecnologias Utilizadas \n\n• HTML \n\n• CSS (responsividade manual) \n\n• JavaScript"
    }
  ]
}